; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 822684 2 2 3 5 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Star3)
	(have_image Planet5 image1)
	(have_image Planet6 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (turn_to satellite1 star3 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star3)
   goals met: 1 of 4
3. (turn_to satellite0 groundstation4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 4
4. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 4
5. (turn_to satellite0 star3 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star3)
   goals met: 2 of 4
6. (turn_to satellite0 planet5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet5)
   goals met: 1 of 4
7. (take_image satellite0 planet5 instrument1 image1)
   added: (have_image planet5 image1)
   goals met: 2 of 4
8. (turn_to satellite0 star3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star3)
   goals met: 3 of 4
9. (turn_to satellite0 planet6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet6)
   goals met: 2 of 4
10. (take_image satellite0 planet6 instrument1 image1)
   added: (have_image planet6 image1)
   goals met: 3 of 4
11. (turn_to satellite0 star3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star3)
   goals met: 4 of 4
